package java_steps.step1;

/*
*
• простота;
Язык Java наследует
синтаксис С/С++ и многие объектно-ориентированные свойства С++, поэтому
для большинства программистов изучение Java не составит больших трудностей.

• безопасность;
• переносимость;

• объектная ориентированность;
Java, создан, по существу, с чистого листа. Одним из следствий этого явился четкий,
практичный, прагматичный подход к объектам.

• надежность;
Java - строго типизированный язык, проверка кода выполняется во время компиляции.
Но проверка кода делается и во время выполнения.
В результате многие трудно обнаруживаемые программные ошибки,
которые часто приводят к возникновению с трудом воспроизводимых
ситуаций во время выполнения, попросту невозможны в программе на Java.
Предсказуемость кода в разных ситуациях - одна из основных особенностей Java.

• многопоточность;
Исполняющая система Java содержит изящное, но вместе с тем сложное решение задачи синхронизации
многих процессов, которое позволяет строить устойчиво работающие интерактивные системы.

• архитектурная нейтральность;
При разработке следующую цель: "Написано однажды, выполняется везде, в любое время и всегда'.
Эта цель была достигнута.

• интерпретируемость;
• высокая производительность;
• распределенность;
Язык Java предназначен для распределенной среды Интернета, поскольку он
поддерживает семейство сетевых протоколов TCP/IP. По существу, обращение
к ресурсу по унифицированному указателю информационного ресурса (URL) мало
чем отличается от обращения к файлу. В языке Java поддерживается также удаленный
вызов методов (Remote Method Invocation - RMI).

• динамичность.
     */